{
  "name": "WorkspaceAgent V2 Dashboard",
  "description": "Replace the Workspace tab in Agent Center with a comprehensive dashboard for WorkspaceAgent V2 features: MCP Tools, Triggers, Playbooks, Skills, Automations, and Meeting Intelligence",
  "branchName": "feat/workspace-agent-v2-dashboard",
  "userStories": [
    {
      "id": "WAD-001",
      "title": "Create tabbed dashboard layout in AgentCenterView",
      "description": "Replace the existing 'workspace' tab option with a new tabbed interface that includes: Tools, Triggers, Playbooks, Skills, Automations, Meetings. The tabs should be styled consistently with the existing CSCX design system (dark theme, cscx-accent red highlights).",
      "acceptanceCriteria": [
        "activeAgentTab state updated to support new tabs: 'chat' | 'tools' | 'triggers' | 'playbooks' | 'skills' | 'automations' | 'meetings'",
        "Tab navigation UI rendered with icons and labels",
        "Each tab shows a placeholder component initially",
        "Tabs are styled with the CSCX dark theme"
      ],
      "priority": 1,
      "passes": true
    },
    {
      "id": "WAD-002",
      "title": "Build MCP Tools Browser component",
      "description": "Create a component that fetches and displays all 47 MCP tools from /api/mcp/tools. Show tools grouped by category (communication, scheduling, documents, meeting_intelligence) with search/filter. Each tool card shows name, description, provider, and approval requirement.",
      "acceptanceCriteria": [
        "Fetches tools from /api/mcp/tools endpoint",
        "Groups tools by category with collapsible sections",
        "Each tool shows: name, description, provider badge, approval indicator",
        "Search input filters tools by name or description",
        "Category filter tabs (All, Gmail, Calendar, Drive, Slack, Zoom)"
      ],
      "priority": 2,
      "passes": true
    },
    {
      "id": "WAD-003",
      "title": "Build Triggers Dashboard component",
      "description": "Create a component to view and manage triggers from /api/triggers. Show list of triggers with their conditions and actions. Include toggle to enable/disable triggers and button to create new ones.",
      "acceptanceCriteria": [
        "Fetches triggers from /api/triggers endpoint",
        "Displays trigger cards with: name, type, condition summary, action count",
        "Enable/disable toggle for each trigger",
        "Shows fire count and last fired timestamp",
        "Empty state with helpful message when no triggers exist"
      ],
      "priority": 3,
      "passes": false
    },
    {
      "id": "WAD-004",
      "title": "Build Playbooks Manager component",
      "description": "Create a component to browse playbook templates from /api/playbooks. Show playbook cards with stages visualization. Allow viewing playbook details and starting execution for a customer.",
      "acceptanceCriteria": [
        "Fetches playbooks from /api/playbooks endpoint",
        "Displays playbook cards with: name, type badge, duration, stage count",
        "Shows stage timeline/progress visualization",
        "Click to expand shows full stage details",
        "Start Playbook button (disabled without customer context)"
      ],
      "priority": 4,
      "passes": false
    },
    {
      "id": "WAD-005",
      "title": "Build Skills Library component",
      "description": "Create a component to browse and execute skills from /api/skills. Show skill cards with inputs and estimated duration. Allow executing skills with input form.",
      "acceptanceCriteria": [
        "Fetches skills from /api/skills endpoint",
        "Displays skill cards with: name, description, icon, category",
        "Shows estimated duration and cost savings percentage",
        "Click to expand shows required variables/inputs",
        "Execute button triggers skill (with customer context if available)"
      ],
      "priority": 5,
      "passes": false
    },
    {
      "id": "WAD-006",
      "title": "Build Automations Panel component",
      "description": "Create a component to view automations from /api/automations. Show automation cards with natural language description and schedule. Include form to create new automation via natural language.",
      "acceptanceCriteria": [
        "Fetches automations from /api/automations endpoint",
        "Displays automation cards with: name, natural language description, schedule",
        "Shows run count, last run, next run timestamps",
        "Enable/disable toggle for each automation",
        "Text input to create new automation via natural language"
      ],
      "priority": 6,
      "passes": false
    },
    {
      "id": "WAD-007",
      "title": "Build Meeting Intelligence Viewer component",
      "description": "Create a component to view meeting analyses from /api/meeting-intelligence/analyses. Show meeting cards with summary, sentiment, action items. Allow filtering by customer.",
      "acceptanceCriteria": [
        "Fetches analyses from /api/meeting-intelligence/analyses endpoint",
        "Displays meeting cards with: title, date, duration, platform",
        "Shows summary preview and sentiment indicator",
        "Click to expand shows: key points, action items, risk indicators",
        "Filter by customer dropdown"
      ],
      "priority": 7,
      "passes": false
    }
  ]
}
