{
  "project": "CSCX.AI",
  "branchName": "feature/chat-ui-cleanup",
  "description": "Clean up chat UI - reduce sidebar bloat while keeping 100% agentic functionality",
  "designPrinciples": [
    "Minimize visual noise, maximize usability",
    "Keep ALL agentic functionality accessible",
    "Use progressive disclosure - show details on demand",
    "Dark theme: #000000 bg, #ffffff text, #e63946 accent",
    "Compact but not cramped"
  ],
  "userStories": [
    {
      "id": "US-001",
      "title": "Collapse CS Specialist Agents into compact selector",
      "description": "Replace 5 large agent cards with a compact dropdown or pill selector",
      "acceptanceCriteria": [
        "In AgentControlCenter/index.tsx, find the CS Specialist Agents section (around lines 1394-1407)",
        "Replace individual agent cards with a compact horizontal pill/chip selector or dropdown",
        "Show agent name + emoji only (e.g., '🎯 Onboarding', '📈 Adoption', '🔄 Renewal', '⚠️ Risk', '🎖️ Strategic')",
        "Clicking a pill/chip selects that agent (same functionality as before)",
        "Selected agent highlighted with accent color #e63946",
        "Total height reduced from ~350px to ~60px max",
        "All 5 agents still accessible and functional",
        "Build succeeds: npm run build"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Agents: Onboarding, Adoption, Renewal, Risk, Strategic CSM. Keep the agent selection logic intact."
    },
    {
      "id": "US-002",
      "title": "Remove System Status section",
      "description": "Remove the verbose system status indicators - redundant information",
      "acceptanceCriteria": [
        "In AgentControlCenter/index.tsx, find System Status section (around lines 1444-1466)",
        "Remove or comment out the entire System Status section",
        "Keep the underlying connection logic intact (just remove the UI display)",
        "If any critical status (like AI backend disconnected) needs to show, use a subtle indicator elsewhere",
        "No functionality lost - just UI removed",
        "Build succeeds: npm run build"
      ],
      "priority": 2,
      "passes": true,
      "notes": "The status info is redundant - users can tell if things work by using the chat. Keep error states visible via toast or inline message."
    },
    {
      "id": "US-003",
      "title": "Remove standalone Google Workspace widget from sidebar",
      "description": "Remove the Google Workspace connection widget - already available in Settings",
      "acceptanceCriteria": [
        "In AgentControlCenter/index.tsx, find the Google Connection Widget section (around lines 1469-1475)",
        "Remove or comment out the Google Workspace widget",
        "Google Workspace connection is already available in Settings (gear icon) via GoogleConnect component",
        "No functionality lost - just removing duplicate UI",
        "Build succeeds: npm run build"
      ],
      "priority": 3,
      "passes": true,
      "notes": "GoogleConnect.tsx in Settings modal already handles this. Removing duplicate."
    },
    {
      "id": "US-004",
      "title": "Compact the AI Model and Knowledge Base toggles",
      "description": "Combine model selector and toggles into a more compact layout",
      "acceptanceCriteria": [
        "In AgentControlCenter/index.tsx, find AI Model Selector (lines 1284-1306) and toggles (1308-1392)",
        "Combine into a single compact 'Settings' row or collapsible section",
        "Model selector: simple dropdown or two-button toggle (Claude/Gemini)",
        "Knowledge Base toggle: small switch with label",
        "AI Enhancement toggle: small switch with label",
        "Arrange horizontally if space permits, or as tight vertical list",
        "Reduce total height by at least 50%",
        "All functionality preserved",
        "Build succeeds: npm run build"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Use compact toggle switches. Consider a single row: [Claude|Gemini] [KB: on] [AI: on]"
    },
    {
      "id": "US-005",
      "title": "Improve overall sidebar spacing and visual hierarchy",
      "description": "Tighten spacing, improve visual hierarchy with better typography",
      "acceptanceCriteria": [
        "In AgentControlCenter/styles.css, reduce gap from 16px to 12px",
        "Use smaller font sizes for labels (text-xs or 0.75rem)",
        "Use consistent section headers with subtle dividers",
        "Ensure sidebar still scrolls if content exceeds viewport",
        "Current Customer and Onboarding Plan sections: keep but make more compact",
        "Overall sidebar should feel lighter and less cluttered",
        "Build succeeds: npm run build"
      ],
      "priority": 5,
      "passes": false,
      "notes": "Focus on typography and spacing. Keep the dark theme consistent."
    },
    {
      "id": "US-006",
      "title": "Verify all agentic functionality still works",
      "description": "Ensure agent selection, model switching, and chat all work after UI changes",
      "acceptanceCriteria": [
        "Agent selection via new compact UI works - selecting an agent changes the active agent",
        "Model toggle (Claude/Gemini) still switches the AI model",
        "Knowledge Base toggle still enables/disables KB context",
        "AI Enhancement toggle still enables/disables enhancements",
        "Chat messages send and receive correctly",
        "Streaming responses work",
        "No console errors related to the UI changes",
        "Build succeeds: npm run build"
      ],
      "priority": 6,
      "passes": false,
      "notes": "This is a verification story - test manually after all UI changes are complete."
    }
  ]
}
